
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("Начало") Тогда 
			Объект.ДатаЗаписи = Параметры.Начало;
		КонецЕсли;
		
		Если Параметры.Свойство("Окончание") Тогда
			Объект.ДатаОкончанияЗаписи = Параметры.Окончание;
		КонецЕсли;
		
		Если Параметры.Свойство("Сотрудник") Тогда
			Объект.Сотрудник = Параметры.Сотрудник;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ДатаЗаписи) Тогда
			Объект.Дата = НачалоДня(Объект.ДатаЗаписи);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	СтрокаТЧУслуги = Элементы.Услуги.ТекущиеДанные;
	ДатаДокумента = Объект.Дата;
	Если ЗначениеЗаполнено(СтрокаТЧУслуги.Услуга) Тогда
		СтрокаТЧУслуги.Стоимость = РаботаСЦенами.ПолучитьЦенуНаДату(СтрокаТЧУслуги.Услуга,,ДатаДокумента);
	Иначе
		СтрокаТЧУслуги.Стоимость = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Записан заказ");
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	//Если НЕ Объект.Ссылка.Пустая() И Объект.УслугаОказана = Ложь Тогда
	//	ОказаниеУслуги = Документы.ЗаписьКлиента.ПроверитьОказаниеУслуги(Объект.Ссылка);
	//	Если НЕ ОказаниеУслуги.Пустой() Тогда
	//		Объект.УслугаОказана = Истина;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры



