&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	СтрокаТЧТовары = Элементы.Товары.ТекущиеДанные;
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаТабличнойЧасти(СтрокаТЧТовары);
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТЧТовары = Элементы.Товары.ТекущиеДанные;
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаТабличнойЧасти(СтрокаТЧТовары);
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ПриОткрытии(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	СтрокаТЧ.Цена = РаботаСЦенами.ЗаполнитьЦенуИзРегистра(Объект.Поставщик, СтрокаТЧ.Товар, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	Для Каждого СтрокаТЧ ИЗ Объект.Товары Цикл
		СтрокаТЧ.Цена = РаботаСЦенами.ЗаполнитьЦенуИзРегистра(Объект.Поставщик, СтрокаТЧ.Товар, Объект.Дата);
	КонецЦикла;
	
КонецПроцедуры






