
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаТабличнойЧасти(СтрокаТабличнойЧасти);
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаДокумента(Объект,Элементы);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаТабличнойЧасти(СтрокаТабличнойЧасти);
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаДокумента(Объект,Элементы);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаДокумента(Объект,Элементы);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОказаниеУслуги = Документы.ЗаписьКлиента.ПроверитьОказаниеУслуги(Объект.Основание);
	Выборка = ОказаниеУслуги.Выбрать();
	Выборка.Следующий();
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Если ОказаниеУслуги.Пустой() Тогда
			Отказ = Ложь;
		ИначеЕсли НЕ ОказаниеУслуги.Пустой()
			И Параметры.Свойство("Основание")
			И ЗначениеЗаполнено(Параметры.Основание) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("По данному документу уже введен документ %1, повторный ввод не требуется.", Выборка.Представление);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	СтрокаТЧУслуги = Элементы.Услуги.ТекущиеДанные;
	ДатаДокумента = Объект.Дата;
	Если ЗначениеЗаполнено(СтрокаТЧУслуги.Услуга) Тогда
		СтрокаТЧУслуги.Сумма = РаботаСЦенами.ПолучитьЦенуНаДату(СтрокаТЧУслуги.Услуга,,ДатаДокумента);
	Иначе
		СтрокаТЧУслуги.Сумма = 0;
	КонецЕсли;
	
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаДокумента(Объект,Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	
	СтрокаТЧТовары = Элементы.Товары.ТекущиеДанные;
	ДатаДокумента = Объект.Дата;
	Если ЗначениеЗаполнено(СтрокаТЧТовары.Товар) Тогда
		СтрокаТЧТовары.Цена = РаботаСЦенами.ПолучитьЦенуНаДату(СтрокаТЧТовары.Товар,,ДатаДокумента);
	Иначе
		СтрокаТЧТовары.Цена = 0;
	КонецЕсли;
	
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаТабличнойЧасти(СтрокаТЧТовары);
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаДокумента(Объект,Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаДокумента(Объект,Элементы);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если СтатусОплаты <> Перечисления.ТипыОплатыДокумента.ПолностьюОплачен Тогда
			СтруктураОплаты = Документы.РеализацияТоваровИУслуг.ПроверитьОплатуДокумента(Объект.Ссылка);
			СтатусОплаты = СтруктураОплаты.СтатусОплаты;
		КонецЕсли;
	Иначе
		СтатусОплаты = Перечисления.ТипыОплатыДокумента.НеОплачен;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаботаССуммойТЧИДокумента.ЗаполнитьСуммаДокумента(Объект,Элементы);
	ПриОткрытииНаСервере();
КонецПроцедуры













