
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость() 
	
	ЭтоСнятиеНаличныхВКассу = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.СнятияНаличныхВКассу"));
	ЭтоОплатаПоставщику = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ОплатаПоставщику"));
	ЭтоВозвратПокупателю = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ВозвратПокупателю"));
	ЭтоПеречислениеПодотчетномуЛицу = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ПеречислениеПодотчетномуЛицу"));
	ЭтоПеречислениеЗаработнойПлаты = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ПеречислениеЗаработнойПлаты"));
	КонтрагентЯвляетсяПоставщиком = КонтрагентЯвляетсяПоставщиком(Объект.Получатель);
	
	Элементы.Получатель.Видимость = ЭтоОплатаПоставщику ИЛИ ЭтоВозвратПокупателю ИЛИ ЭтоПеречислениеЗаработнойПлаты ИЛИ ЭтоПеречислениеПодотчетномуЛицу;
	Элементы.Касса.Видимость = ЭтоСнятиеНаличныхВКассу;
	Элементы.ДоговорКонтрагента.Видимость = ЭтоОплатаПоставщику И КонтрагентЯвляетсяПоставщиком;
	
	СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
	Если ЭтоОплатаПоставщику ИЛИ ЭтоВозвратПокупателю Тогда
		СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
	КонецЕсли;
	
	Массив = Новый Массив();
	Массив.Добавить(Тип(СтрокаТипПолучателя));
	
	ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
	Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя
	
КонецПроцедуры

&НаСервере
Функция КонтрагентЯвляетсяПоставщиком(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТипКонтрагента",Перечисления.ТипыКонтрагентов.Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|	И Контрагенты.ТипКонтрагента = &ТипКонтрагента";
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.АвторДокумента) Тогда
		Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры




