&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость(); 
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость(); 
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость()
	
	Если 
		Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.Наименование.Заголовок = "Ф.И.О. клента";
		Элементы.ДатаРождения.Видимость = Истина;
		элементы.ДатаРождения.Заголовок = "Дата рождения клиента";
		Элементы.ПолКлиента.Видимость = Истина;
		Элементы.ПолКлиента.Заголовок = "Пол";
		Элементы.Источник.Видимость = Истина;
		Элементы.Питомцы.Видимость = Истина;
		Элементы.ОсновнойДоговор.Видимость = Ложь;
		Объект.ОсновнойДоговор = Неопределено;
		Элементы.Комментарий.Ширина = 0;
		Элементы.Комментарий.РастягиватьПоГоризонтали = Истина;
		
	ИначеЕсли 
		Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Поставщик") Тогда
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.ДатаРождения.Видимость = Ложь;
		Объект.ДатаРождения = Неопределено;
		Элементы.ПолКлиента.Видимость = Ложь;
		Объект.ПолКлиента = Неопределено;
		Элементы.Источник.Видимость = Ложь;
		Объект.Источник = Неопределено;
		Элементы.Питомцы.Видимость = Ложь;
		Объект.Питомцы.Очистить();
		Элементы.ОсновнойДоговор.Видимость = Истина;
		Элементы.Комментарий.Ширина = 53;
		Элементы.Комментарий.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли
	
КонецПроцедуры



