 Функция ПроверитьОказаниеУслуги (Ссылка) Экспорт
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	РеализацияТоваровИУслуг.Ссылка КАК Ссылка,
	                |	РеализацияТоваровИУслуг.Представление КАК Представление
	                |ПОМЕСТИТЬ ВТ_Реализация
	                |ИЗ
	                |	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	                |ГДЕ
	                |	РеализацияТоваровИУслуг.Основание = &Основание
	                |	И РеализацияТоваровИУслуг.Проведен
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаписьКлиента.Ссылка КАК Ссылка,
	                |	ВТ_Реализация.Представление КАК Представление
	                |ПОМЕСТИТЬ ВТ_Запись_Реализация
	                |ИЗ
	                |	Документ.ЗаписьКлиента КАК ЗаписьКлиента
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
	                |		ПО (ЗаписьКлиента.Ссылка = ВТ_Реализация.Ссылка.Основание)
	                |ГДЕ
	                |	ЗаписьКлиента.Ссылка = &Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_Запись_Реализация.Ссылка КАК Ссылка,
	                |	ВТ_Запись_Реализация.Представление КАК Представление
	                |ИЗ
	                |	ВТ_Запись_Реализация КАК ВТ_Запись_Реализация
	                |ГДЕ
	                |	ВТ_Запись_Реализация.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Основание",Ссылка);
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 
	 Результат = Запрос.Выполнить();
	 Возврат Результат;
	 
 КонецФункции
 