
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ЗаписьКлиента = Ссылка;
	Движение.СуммаПлан = Услуги.Итог("Стоимость");
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ОбработкаРезультатаПроверкиОказанияУслуги();
	
	ДлительностьУслуги = ЗаполнитьЗначениеДатаОкончаниеЗаписи();
	Если ДлительностьУслуги = 0 Тогда
		ДлительностьУслуги = 60;
	КонецЕсли;
	ДатаОкончанияЗаписи = ДатаЗаписи + ДлительностьУслуги*60;
	
КонецПроцедуры

Процедура ОбработкаРезультатаПроверкиОказанияУслуги ()
	
	Если ЗначениеЗаполнено(Ссылка) И УслугаОказана = Ложь Тогда
		ОказаниеУслуги = Документы.ЗаписьКлиента.ПроверитьОказаниеУслуги(Ссылка);
		Если НЕ ОказаниеУслуги.Пустой() Тогда
			УслугаОказана = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьЗначениеДатаОкончаниеЗаписи()
ТЧУслуги = Услуги.Выгрузить(,"Услуга");

Запрос = Новый Запрос;
Запрос.УстановитьПараметр("ТЧУслуги",ТЧУслуги);
Запрос.Текст = "ВЫБРАТЬ
|	ТЧУслуги.Услуга КАК Номенклатура
|ПОМЕСТИТЬ ВТ_Номенклатура
|ИЗ
|	&ТЧУслуги КАК ТЧУслуги
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	СУММА(Ном.ДлительностьУслугиВМинутах) КАК ДлительностьУслуги
|ИЗ
|	ВТ_Номенклатура КАК ВТ_Номенклатура
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
|		ПО ВТ_Номенклатура.Номенклатура = Ном.Ссылка";

Рез = Запрос.Выполнить();
Если Рез.Пустой() Тогда
    возврат 0;
КонецЕсли;

Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();
возврат Выборка.ДлительностьУслуги;

КонецФункции




