Функция ПолучитьЦенуНаДату (Номенклатура, ВидЦены = Неопределено, ДатаЦены = Неопределено) Экспорт
	
	Если ВидЦены = Неопределено Тогда
		ВидЦены = Перечисления.ВидыЦенНоменклатуры.Розничная;
	КонецЕсли;
	
	
	ЗапросЦены = Новый Запрос;
	ЗапросЦены.Текст = "ВЫБРАТЬ
	                   |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	                   |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	                   |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	                   |ИЗ
	                   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                   |			&Период,
	                   |			Номенклатура = &Номенклатура
	                   |				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	ЗапросЦены.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросЦены.УстановитьПараметр("Период", ДатаЦены);
	ЗапросЦены.УстановитьПараметр("ВидЦены", ВидЦены);
	
	РезультатЗапроса = ЗапросЦены.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("В базе данных не найдены цены для данной номенклатуры");
		Возврат 0;
	КонецЕсли;
	
	Выборка = ЗапросЦены.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Цена;
	
КонецФункции

Функция ЗаполнитьЦенуИзРегистра(Поставщик,Номенклатура,ДатаДокумента)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыПоставщиковСрезПоследних.Поставщик КАК Поставщик,
		|	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
		|			&Период,
		|			Номенклатура = &Номенклатура
		|				И Поставщик = &Поставщик) КАК ЦеныНоменклатурыПоставщиковСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", ДатаДокумента);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Для номенклатуры %1 отсутствует цена в регистре",Номенклатура);
		Сообщение.Сообщить();
		Возврат 0;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Цена;
	КонецЕсли;
	
	
КонецФункции



