
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	СчетКредита = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ПоступлениеУслугУслуги.Сумма КАК Сумма,
		|	ПоступлениеУслуг.Ссылка КАК Регистратор,
		|	ПоступлениеУслуг.Дата КАК Период,
		|	ПоступлениеУслугУслуги.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
		|ИЗ
		|	Документ.ПоступлениеУслуг КАК ПоступлениеУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеУслуг.Услуги КАК ПоступлениеУслугУслуги
		|		ПО ПоступлениеУслуг.Ссылка = ПоступлениеУслугУслуги.Ссылка
		|ГДЕ
		|	ПоступлениеУслугУслуги.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	СтатьяЗатрат";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСтатьяЗатрат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтатьяЗатрат.Следующий() Цикл
		Движение = Движения.УчетЗатрат.Добавить();
		Движение.СтатьяЗатрат = ВыборкаСтатьяЗатрат.СтатьяЗатрат;
		Движение.Период = Дата;
		Движение.Сумма = ВыборкаСтатьяЗатрат.Сумма;
		
		ВыборкаДетальныеЗаписи = ВыборкаСтатьяЗатрат.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = ВыборкаДетальныеЗаписи.СчетБухгалтерскогоУчета;
			Движение.СчетКт = СчетКредита;
			Движение.Период = Дата;
			Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
			Движение.Содержание = "Отражено поступление услуг от поставщика";
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, ВыборкаДетальныеЗаписи.СтатьяЗатрат);
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, Поставщик);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
