
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.УчетнаяПолитика = УчетнаяПолитика;
	
	СтруктураУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
	Если УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПоСреднейСкользящей
		И СтруктураУчетнаяПолитика.УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.FEFO Тогда
		
		Движения.ТоварыНаСкладах.Записывать = Истина;
		Движения.ТоварыНаСкладах.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ТоварыНаСкладахОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментВремени, ) КАК ТоварыНаСкладахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.СрокГодности
		|ИТОГИ
		|	МАКСИМУМ(КоличествоОстаток)
		|ПО
		|	Номенклатура,
		|	Склад";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ВыборкаСклад = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаСклад.Следующий() Цикл
			
			ВыборкаДетальныеЗаписи = ВыборкаСклад.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
			Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Склад = ВыборкаДетальныеЗаписи.Склад;
			Движение.СрокГодности = ВыборкаДетальныеЗаписи.СрокГодности;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
			Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
			
			Движение = Движения.ТоварыНаСкладах.ДобавитьПриход();
			Движение.Период = Дата;
            Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Склад = ВыборкаДетальныеЗаписи.Склад;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
			Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
			
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецЕсли;

	

		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		//               |	ТоварыНаСкладахОстатки.Склад КАК Склад,
		//               |	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		//               |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		//               |ИЗ
		//               |	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментВремени, ) КАК ТоварыНаСкладахОстатки
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	ТоварыНаСкладахОстатки.Номенклатура,
		//               |	ТоварыНаСкладахОстатки.Склад,
		//               |	ТоварыНаСкладахОстатки.СрокГодности
		//               |ИТОГИ
		//               |	МАКСИМУМ(КоличествоОстаток)
		//               |ПО
		//               |	Номенклатура,
		//               |	Склад";
		//Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
		//Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//Пока Выборка.Следующий() Цикл
		//	Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
		//	Движение.Период = Дата;
		//	ЗаполнитьЗначенияСвойств(Движение, Выборка);
		//	
		//	Движение = Движения.ТоварыНаСкладах.ДобавитьПриход();
		//	Движение.Период = Дата;
		//	ЗаполнитьЗначенияСвойств(Движение, Выборка,,"СрокГодности");
	//	КонецЦикла;
	//КонецЕсли;
	//
	
КонецПроцедуры
