
&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	ПризнакБезсрочногоДоговора()
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование()
	
	ДатаЗаключенияБезВремени = Формат(Объект.ДатаЗаключенияДоговора,"ДФ=дд.ММ.гггг");
	
	Если ЗначениеЗаполнено(Объект.НомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		
		Объект.Наименование = "№ " + Объект.НомерДоговора + " от " + ДатаЗаключенияБезВремени + " г.";
		
	ИначеЕсли ЗначениеЗаполнено(Объект.НомерДоговора)
		И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		
		Объект.Наименование = "№ " + Объект.НомерДоговора; 
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.НомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда 
		
		Объект.Наименование = " от " + ДатаЗаключенияБезВремени + " г.";
		
	КонецЕсли
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПризнакБезсрочногоДоговора()
	
	Если Объект.Бессрочный = Истина Тогда 
		Элементы.СрокДействияДоговора.Видимость = Ложь;
		Объект.СрокДействияДоговора = Неопределено;
	Иначе
		Элементы.СрокДействияДоговора.Видимость = Истина;
	КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьНаименование();
	ПризнакБезсрочногоДоговора();
КонецПроцедуры
