
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ЗаполнитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ЗаполнитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ЗаполнитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФИО()
	
	Если ЗначениеЗаполнено(Объект.Имя)
		И ЗначениеЗаполнено(Объект.Фамилия)
		И ЗначениеЗаполнено(Объект.Отчество) Тогда
		Объект.Наименование = Объект.Имя + " " + Объект.Фамилия + " " + Объект.Отчество;
	ИначеЕсли ЗначениеЗаполнено(Объект.Имя)
		И ЗначениеЗаполнено(Объект.Фамилия)
		И НЕ ЗначениеЗаполнено(Объект.Отчество) Тогда
		Объект.Наименование = Объект.Имя + " " + Объект.Фамилия;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьФИО();
КонецПроцедуры


