
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.АвторДокумента) Тогда
		Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	СтрокаТЧ.Цена = РаботаСЦенами.ЗаполнитьЦенуИзРегистра(Объект.Поставщик, СтрокаТЧ.Номенклатура, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Для Каждого СтрокаТЧ ИЗ Объект.Услуги Цикл
		СтрокаТЧ.Цена = РаботаСЦенами.ЗаполнитьЦенуИзРегистра(Объект.Поставщик, СтрокаТЧ.Номенклатура, Объект.Дата);
	КонецЦикла;
	
КонецПроцедуры


