
Процедура ПолучитьПодтверждениеРегистрацииПользователяПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	РегистрацияПодтверждена = Задача.ПолученоСогласие;
КонецПроцедуры

Процедура ПользовательПодтвердилРегистрациюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РегистрацияПодтверждена;
КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистрацииПользователяПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Наименование = "Получить согласие клиента "+ Пользователь +" на регистрацию";
		ФормируемаяЗадача.Предмет = Пользователь;
		ФормируемаяЗадача.ОписаниеЗадачи = "Из мобильного приложения поступила заявка на регистрацию пользователя.|
		|Необходимо зозвониться с клиентом "+ Пользователь +" по телефону "+ Пользователь.Клиент.КонтактныйТелефон+" и получить согласие на регистрацию,|
		|а так же дозаполнить карточку клиента - ФИО, Дату рождения. сведения о питомцах и другие данные,|
		|которые клиент согласен предоставить.";
		ФормируемаяЗадача.Роль = ТочкаМаршрутаБизнесПроцесса.РольИсполнителя;
	КонецЦикла;
КонецПроцедуры


Процедура ПометкаНаУдвлениеПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)

	ПометкаУдаленияУстановить = Пользователь.ПолучитьОбъект();
	ПометкаУдаленияУстановить.ПометкаУдаления = Истина;
	ПометкаУдаленияУстановить.Записать();
	
КонецПроцедуры

