
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаписьКлиента") Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Стоимость;
			НоваяСтрока.Услуга = ТекСтрокаУслуги.Услуга;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.ТоварыНаСкладах.Записать();
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Товар");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслугТовары.Товар КАК Товар,
	|	СУММА(РеализацияТоваровИУслугТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТоваровИУслугТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
	|ГДЕ
	|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугТовары.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровИУслугУслуги.Услуга,
	|	NULL,
	|	СУММА(РеализацияТоваровИУслугУслуги.Сумма)
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК РеализацияТоваровИУслугУслуги
	|ГДЕ
	|	РеализацияТоваровИУслугУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугУслуги.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Товар КАК Товар,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Товар.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТовар,
	|	ВТ_Товары.Товар.Представление КАК ТоварПредставление,
	|	ВТ_Товары.Количество КАК КоличествоВДокументе,
	|	ВТ_Товары.Сумма КАК СуммаВДокументе,
	|	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ВТ_Товары.Товар.СтатьяЗатрат КАК ТоварСтатьяЗатрат,
	|	ВТ_Товары.Товар.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МоментВремени,
	|				Склад = &Склад
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							Т.Товар
	|						ИЗ
	|							ВТ_Товары КАК Т)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Товары.Товар = ТоварыНаСкладахОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.СрокГодности,
	|	ВТ_Товары.Товар,
	|	ВТ_Товары.Товар.Представление,
	|	ВТ_Товары.Количество,
	|	ВТ_Товары.Сумма,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток,
	|	ТоварыНаСкладахОстатки.СуммаОстаток,
	|	ВТ_Товары.Товар.СтатьяЗатрат,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Товар.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СрокГодности
	|ИТОГИ
	|	МАКСИМУМ(КоличествоВДокументе),
	|	МАКСИМУМ(СуммаВДокументе),
	|	СУММА(КоличествоОстаток)
	|ПО
	|	ТоварСтатьяЗатрат,
	|	Товар";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТоварСтатьяЗатрат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТоварСтатьяЗатрат.Следующий() Цикл
		
		СтоимостьТоваровОбщая = 0;
		
		ВыборкаТовары = ВыборкаТоварСтатьяЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТовары.Следующий() Цикл
			Если ВыборкаТовары.ЭтоТовар Тогда
				
				ВыборкаТоварыДетальные = ВыборкаТовары.Выбрать();
				
				Запрет = Константы.ЗапретПроведенияПриОтрицательныхОстатках.Получить();
				Превышение = ВыборкаТовары.КоличествоВДокументе - ВыборкаТовары.КоличествоОстаток;
				Если Превышение > 0 
					И Запрет Тогда 
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Проведение запрещено. Превышение остатка по номенклатуре ""%1""  в количестве ""%2""", ВыборкаТовары.ТоварПредставление, Превышение);
					Сообщение.Сообщить();
					Отказ = Истина;	
				ИначеЕсли Превышение > 0
					И Запрет = ЛОЖЬ Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Внимание. Превышение остатка по номенклатуре ""%1""  в количестве ""%2""", ВыборкаТовары.ТоварПредставление, Превышение);;
					Сообщение.Сообщить();;
				КонецЕсли;
				
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;
				
				ОсталосьСписать = ВыборкаТовары.КоличествоВДокументе;
				
				Пока ВыборкаТоварыДетальные.Следующий() И ОсталосьСписать > 0  Цикл
					НужноСписать = Мин(ВыборкаТоварыДетальные.КоличествоОстаток,ОсталосьСписать);
					Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
					Движение.Период = Дата;
					Движение.Номенклатура = ВыборкаТоварыДетальные.Товар;
					Движение.Склад = Склад;
					Движение.СрокГодности = ВыборкаТоварыДетальные.СрокГодности;
					Движение.Количество = НужноСписать;
					Если НужноСписать = ВыборкаТоварыДетальные.КоличествоОстаток Тогда
						СуммаСписания = ВыборкаТоварыДетальные.СуммаОстаток;
					Иначе
						СуммаСписания = НужноСписать/ВыборкаТоварыДетальные.КоличествоОстаток*ВыборкаТоварыДетальные.СуммаОстаток;
					КонецЕсли;
					Движение.Сумма = СуммаСписания;
					ОсталосьСписать = ОсталосьСписать - НужноСписать;
					СтоимостьТоваровОбщая = СтоимостьТоваровОбщая+Движение.Сумма;
					
					Движение = Движения.Хозрасчетный.Добавить();
					Движение.СчетДт = ПланыСчетов.Хозрасчетный.Продажи;
					Движение.СчетКт = ВыборкаТоварыДетальные.СчетБухгалтерскогоУчета;
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ВыборкаТоварыДетальные.Товар;
					Движение.Период = Дата;
					Движение.Сумма = СуммаСписания;
					Движение.Содержание = "Списана себестоимость товарно-материальных ценностей";
					
				КонецЦикла;
				
				Если ОсталосьСписать > 0 Тогда
					Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
					Движение.Период = Дата;
					Движение.Номенклатура = ВыборкаТовары.Товар;
					Движение.Склад = Склад;
					Движение.СрокГодности = Неопределено;
					Движение.Количество = ОсталосьСписать;
					Движение.Сумма = 0;
				КонецЕсли;
			КонецЕсли;
			Движения.Продажи.Записывать = Истина;
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаТовары.Товар;
			Движение.Сотрудник = Сотрудник;
			Движение.Клиент = Клиент;
			Движение.Сумма = ВыборкаТовары.СуммаВДокументе;
		КонецЦикла;
		Если СтоимостьТоваровОбщая > 0 Тогда
			Движение = Движения.УчетЗатрат.Добавить();
			Движение.Период = Дата;
			Движение.СтатьяЗатрат = ВыборкаТоварСтатьяЗатрат.ТоварСтатьяЗатрат;
			Движение.Сумма = СтоимостьТоваровОбщая;
		КонецЕсли;
	КонецЦикла;
	
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.Продажи;
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Клиент);
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.Содержание = "Отражена выручка от реализации товаров и услуг";
		
	Если ЗначениеЗаполнено(Основание) Тогда
		Движения.ЗаказыКлиентов.Записывать = Истина;
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.ЗаписьКлиента = Основание;
		Движение.СуммаФакт = Услуги.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(Основание)Тогда 
		ЗаписьКлиентаДокумент = Основание.ПолучитьОбъект();
		ЗаписьКлиентаДокумент.УслугаОказана = Истина;
		ЗаписьКлиентаДокумент.Записать();
	КонецЕсли;
	
КонецПроцедуры






