
&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	УстановитьВидимостьТипОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьТипОрганизации();
КонецПроцедуры

Процедура УстановитьВидимостьТипОрганизации()
	
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
		Элементы.ИНН.Маска = "9999999999";
	ИначеЕсли
		Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
		Объект.ГлавныйБухгалтер = Неопределено;
		Элементы.ИНН.Маска = "999999999999";
	КонецЕсли;
	
КонецПроцедуры
